{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantize_v2", 
      "name": "data_quantize", 
      "attrs": {"out_type": "auto"}, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 3, 7, 7)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_bn_relu_0", 
      "attrs": {
        "max_calib_range": "28.366196", 
        "min_calib_range": "-0.000000", 
        "quantized": "true", 
        "with_bn": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[1, 0, 0], [2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 1], [6, 0, 1], [1, 1, 0], [1, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "data0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "resnetv10_conv0_weight0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "resnetv10_conv0_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(7, 7)", 
                "layout": "NCHW", 
                "no_bias": "True", 
                "num_filter": "64", 
                "num_group": "1", 
                "pad": "(3, 3)", 
                "stride": "(2, 2)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "resnetv10_batchnorm0_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "resnetv10_batchnorm0_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "resnetv10_batchnorm0_running_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "resnetv10_batchnorm0_running_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "resnetv10_batchnorm0_fwd", 
              "attrs": {
                "axis": "1", 
                "eps": "1e-05", 
                "fix_gamma": "False", 
                "momentum": "0.9", 
                "use_global_stats": "False"
              }, 
              "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "resnetv10_relu0_fwd", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[7, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 3, 4, 5, 6], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 10, 11], 
          "heads": [[8, 0, 0]]
        }
      ]
    }, 
    {
      "op": "_contrib_quantized_pooling", 
      "name": "quantized_resnetv10_pool0_fwd", 
      "attrs": {
        "global_pool": "False", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "pad": "(1, 1)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[7, 0, 0], [7, 1, 0], [7, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 64, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_conv0_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_bn_relu_1", 
      "attrs": {
        "max_calib_range": "17.692879", 
        "min_calib_range": "-0.000000", 
        "quantized": "true", 
        "with_bn": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[8, 0, 0], [9, 0, 0], [10, 0, 0], [11, 0, 0], [12, 0, 0], [13, 0, 1], [14, 0, 1], [8, 1, 0], [8, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "resnetv10_pool0_fwd_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "resnetv10_stage1_conv0_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "resnetv10_stage1_conv0_bias0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "resnetv10_stage1_conv0_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(1, 1)", 
                "layout": "NCHW", 
                "no_bias": "False", 
                "num_filter": "64", 
                "num_group": "1", 
                "pad": "(0, 0)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "resnetv10_stage1_batchnorm0_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "resnetv10_stage1_batchnorm0_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "resnetv10_stage1_batchnorm0_running_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "resnetv10_stage1_batchnorm0_running_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "resnetv10_stage1_batchnorm0_fwd", 
              "attrs": {
                "axis": "1", 
                "eps": "1e-05", 
                "fix_gamma": "False", 
                "momentum": "0.9", 
                "use_global_stats": "False"
              }, 
              "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0], [7, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "resnetv10_stage1_relu0_fwd", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[8, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2, 4, 5, 6, 7], 
          "node_row_ptr": [
            0, 
            1, 
            2, 
            3, 
            4, 
            5, 
            6, 
            7, 
            8, 
            11, 
            12
          ], 
          "heads": [[9, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_conv1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 64, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_batchnorm1_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_batchnorm1_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_batchnorm1_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_batchnorm1_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_bn_relu_2", 
      "attrs": {
        "max_calib_range": "15.738866", 
        "min_calib_range": "-0.000000", 
        "quantized": "true", 
        "with_bn": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[15, 0, 0], [16, 0, 0], [17, 0, 0], [18, 0, 0], [19, 0, 1], [20, 0, 1], [15, 1, 0], [15, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_bn_relu_1_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "resnetv10_stage1_conv1_weight0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "resnetv10_stage1_conv1_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(3, 3)", 
                "layout": "NCHW", 
                "no_bias": "True", 
                "num_filter": "64", 
                "num_group": "1", 
                "pad": "(1, 1)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "resnetv10_stage1_batchnorm1_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "resnetv10_stage1_batchnorm1_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "resnetv10_stage1_batchnorm1_running_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "resnetv10_stage1_batchnorm1_running_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "resnetv10_stage1_batchnorm1_fwd", 
              "attrs": {
                "axis": "1", 
                "eps": "1e-05", 
                "fix_gamma": "False", 
                "momentum": "0.9", 
                "use_global_stats": "False"
              }, 
              "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "resnetv10_stage1_relu1_fwd", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[7, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 3, 4, 5, 6], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 10, 11], 
          "heads": [[8, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_conv2_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256, 64, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_conv2_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_batchnorm2_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_batchnorm2_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_batchnorm2_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_batchnorm2_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_conv3_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256, 64, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_batchnorm3_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_batchnorm3_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_batchnorm3_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_batchnorm3_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_bn_4", 
      "attrs": {
        "max_calib_range": "14.089601", 
        "min_calib_range": "-36.878681", 
        "quantized": "true", 
        "with_bn": "true"
      }, 
      "inputs": [[8, 0, 0], [28, 0, 0], [29, 0, 0], [30, 0, 0], [31, 0, 1], [32, 0, 1], [8, 1, 0], [8, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "resnetv10_pool0_fwd_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "resnetv10_stage1_conv3_weight0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "resnetv10_stage1_conv3_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(1, 1)", 
                "layout": "NCHW", 
                "no_bias": "True", 
                "num_filter": "256", 
                "num_group": "1", 
                "pad": "(0, 0)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "resnetv10_stage1_batchnorm3_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "resnetv10_stage1_batchnorm3_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "resnetv10_stage1_batchnorm3_running_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "resnetv10_stage1_batchnorm3_running_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "resnetv10_stage1_batchnorm3_fwd", 
              "attrs": {
                "axis": "1", 
                "eps": "1e-05", 
                "fix_gamma": "False", 
                "momentum": "0.9", 
                "use_global_stats": "False"
              }, 
              "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 3, 4, 5, 6], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 10], 
          "heads": [[7, 0, 0]]
        }
      ]
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_bn_add_relu_3", 
      "attrs": {
        "max_calib_range": "14.925311", 
        "min_calib_range": "-0.000000", 
        "quantized": "true", 
        "with_bn": "true", 
        "with_postsum_relu": "true", 
        "with_sum": "true"
      }, 
      "inputs": [
        [21, 0, 0], 
        [22, 0, 0], 
        [23, 0, 0], 
        [24, 0, 0], 
        [25, 0, 0], 
        [26, 0, 1], 
        [27, 0, 1], 
        [33, 0, 0], 
        [21, 1, 0], 
        [21, 2, 0], 
        [33, 1, 0], 
        [33, 2, 0]
      ], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_bn_relu_2_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "resnetv10_stage1_conv2_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "resnetv10_stage1_conv2_bias0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "resnetv10_stage1_conv2_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(1, 1)", 
                "layout": "NCHW", 
                "no_bias": "False", 
                "num_filter": "256", 
                "num_group": "1", 
                "pad": "(0, 0)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "resnetv10_stage1_batchnorm2_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "resnetv10_stage1_batchnorm2_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "resnetv10_stage1_batchnorm2_running_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "resnetv10_stage1_batchnorm2_running_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "resnetv10_stage1_batchnorm2_fwd", 
              "attrs": {
                "axis": "1", 
                "eps": "1e-05", 
                "fix_gamma": "False", 
                "momentum": "0.9", 
                "use_global_stats": "False"
              }, 
              "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0], [7, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "resnetv10_stage1_batchnorm3_fwd_output0", 
              "inputs": []
            }, 
            {
              "op": "elemwise_add", 
              "name": "resnetv10_stage1__plus0", 
              "inputs": [[8, 0, 0], [9, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "resnetv10_stage1_activation0", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[10, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2, 4, 5, 6, 7, 9], 
          "node_row_ptr": [
            0, 
            1, 
            2, 
            3, 
            4, 
            5, 
            6, 
            7, 
            8, 
            11, 
            12, 
            13, 
            14
          ], 
          "heads": [[11, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_conv4_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 256, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_conv4_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_batchnorm4_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_batchnorm4_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_batchnorm4_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_batchnorm4_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_bn_relu_5", 
      "attrs": {
        "max_calib_range": "10.324755", 
        "min_calib_range": "-0.000000", 
        "quantized": "true", 
        "with_bn": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[34, 0, 0], [35, 0, 0], [36, 0, 0], [37, 0, 0], [38, 0, 0], [39, 0, 1], [40, 0, 1], [34, 1, 0], [34, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_bn_add_relu_3_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "resnetv10_stage1_conv4_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "resnetv10_stage1_conv4_bias0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "resnetv10_stage1_conv4_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(1, 1)", 
                "layout": "NCHW", 
                "no_bias": "False", 
                "num_filter": "64", 
                "num_group": "1", 
                "pad": "(0, 0)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "resnetv10_stage1_batchnorm4_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "resnetv10_stage1_batchnorm4_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "resnetv10_stage1_batchnorm4_running_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "resnetv10_stage1_batchnorm4_running_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "resnetv10_stage1_batchnorm4_fwd", 
              "attrs": {
                "axis": "1", 
                "eps": "1e-05", 
                "fix_gamma": "False", 
                "momentum": "0.9", 
                "use_global_stats": "False"
              }, 
              "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0], [7, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "resnetv10_stage1_relu2_fwd", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[8, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2, 4, 5, 6, 7], 
          "node_row_ptr": [
            0, 
            1, 
            2, 
            3, 
            4, 
            5, 
            6, 
            7, 
            8, 
            11, 
            12
          ], 
          "heads": [[9, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_conv5_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 64, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_batchnorm5_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_batchnorm5_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_batchnorm5_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_batchnorm5_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_bn_relu_6", 
      "attrs": {
        "max_calib_range": "12.012566", 
        "min_calib_range": "-0.000000", 
        "quantized": "true", 
        "with_bn": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[41, 0, 0], [42, 0, 0], [43, 0, 0], [44, 0, 0], [45, 0, 1], [46, 0, 1], [41, 1, 0], [41, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_bn_relu_5_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "resnetv10_stage1_conv5_weight0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "resnetv10_stage1_conv5_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(3, 3)", 
                "layout": "NCHW", 
                "no_bias": "True", 
                "num_filter": "64", 
                "num_group": "1", 
                "pad": "(1, 1)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "resnetv10_stage1_batchnorm5_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "resnetv10_stage1_batchnorm5_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "resnetv10_stage1_batchnorm5_running_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "resnetv10_stage1_batchnorm5_running_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "resnetv10_stage1_batchnorm5_fwd", 
              "attrs": {
                "axis": "1", 
                "eps": "1e-05", 
                "fix_gamma": "False", 
                "momentum": "0.9", 
                "use_global_stats": "False"
              }, 
              "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "resnetv10_stage1_relu3_fwd", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[7, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 3, 4, 5, 6], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 10, 11], 
          "heads": [[8, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_conv6_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256, 64, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_conv6_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_batchnorm6_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_batchnorm6_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_batchnorm6_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_batchnorm6_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_bn_add_relu_7", 
      "attrs": {
        "max_calib_range": "20.961098", 
        "min_calib_range": "-0.000000", 
        "quantized": "true", 
        "with_bn": "true", 
        "with_postsum_relu": "true", 
        "with_sum": "true"
      }, 
      "inputs": [
        [47, 0, 0], 
        [48, 0, 0], 
        [49, 0, 0], 
        [50, 0, 0], 
        [51, 0, 0], 
        [52, 0, 1], 
        [53, 0, 1], 
        [34, 0, 0], 
        [47, 1, 0], 
        [47, 2, 0], 
        [34, 1, 0], 
        [34, 2, 0]
      ], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_bn_relu_6_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "resnetv10_stage1_conv6_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "resnetv10_stage1_conv6_bias0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "resnetv10_stage1_conv6_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(1, 1)", 
                "layout": "NCHW", 
                "no_bias": "False", 
                "num_filter": "256", 
                "num_group": "1", 
                "pad": "(0, 0)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "resnetv10_stage1_batchnorm6_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "resnetv10_stage1_batchnorm6_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "resnetv10_stage1_batchnorm6_running_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "resnetv10_stage1_batchnorm6_running_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "resnetv10_stage1_batchnorm6_fwd", 
              "attrs": {
                "axis": "1", 
                "eps": "1e-05", 
                "fix_gamma": "False", 
                "momentum": "0.9", 
                "use_global_stats": "False"
              }, 
              "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0], [7, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_bn_add_relu_3_output0", 
              "inputs": []
            }, 
            {
              "op": "elemwise_add", 
              "name": "resnetv10_stage1__plus1", 
              "inputs": [[8, 0, 0], [9, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "resnetv10_stage1_activation1", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[10, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2, 4, 5, 6, 7, 9], 
          "node_row_ptr": [
            0, 
            1, 
            2, 
            3, 
            4, 
            5, 
            6, 
            7, 
            8, 
            11, 
            12, 
            13, 
            14
          ], 
          "heads": [[11, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_conv7_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 256, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_conv7_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_batchnorm7_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_batchnorm7_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_batchnorm7_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_batchnorm7_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_bn_relu_8", 
      "attrs": {
        "max_calib_range": "14.017304", 
        "min_calib_range": "-0.000000", 
        "quantized": "true", 
        "with_bn": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[54, 0, 0], [55, 0, 0], [56, 0, 0], [57, 0, 0], [58, 0, 0], [59, 0, 1], [60, 0, 1], [54, 1, 0], [54, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_bn_add_relu_7_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "resnetv10_stage1_conv7_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "resnetv10_stage1_conv7_bias0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "resnetv10_stage1_conv7_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(1, 1)", 
                "layout": "NCHW", 
                "no_bias": "False", 
                "num_filter": "64", 
                "num_group": "1", 
                "pad": "(0, 0)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "resnetv10_stage1_batchnorm7_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "resnetv10_stage1_batchnorm7_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "resnetv10_stage1_batchnorm7_running_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "resnetv10_stage1_batchnorm7_running_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "resnetv10_stage1_batchnorm7_fwd", 
              "attrs": {
                "axis": "1", 
                "eps": "1e-05", 
                "fix_gamma": "False", 
                "momentum": "0.9", 
                "use_global_stats": "False"
              }, 
              "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0], [7, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "resnetv10_stage1_relu4_fwd", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[8, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2, 4, 5, 6, 7], 
          "node_row_ptr": [
            0, 
            1, 
            2, 
            3, 
            4, 
            5, 
            6, 
            7, 
            8, 
            11, 
            12
          ], 
          "heads": [[9, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_conv8_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 64, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_batchnorm8_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_batchnorm8_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_batchnorm8_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_batchnorm8_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_bn_relu_9", 
      "attrs": {
        "max_calib_range": "24.763096", 
        "min_calib_range": "-0.000000", 
        "quantized": "true", 
        "with_bn": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[61, 0, 0], [62, 0, 0], [63, 0, 0], [64, 0, 0], [65, 0, 1], [66, 0, 1], [61, 1, 0], [61, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_bn_relu_8_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "resnetv10_stage1_conv8_weight0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "resnetv10_stage1_conv8_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(3, 3)", 
                "layout": "NCHW", 
                "no_bias": "True", 
                "num_filter": "64", 
                "num_group": "1", 
                "pad": "(1, 1)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "resnetv10_stage1_batchnorm8_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "resnetv10_stage1_batchnorm8_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "resnetv10_stage1_batchnorm8_running_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "resnetv10_stage1_batchnorm8_running_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "resnetv10_stage1_batchnorm8_fwd", 
              "attrs": {
                "axis": "1", 
                "eps": "1e-05", 
                "fix_gamma": "False", 
                "momentum": "0.9", 
                "use_global_stats": "False"
              }, 
              "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "resnetv10_stage1_relu5_fwd", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[7, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 3, 4, 5, 6], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 10, 11], 
          "heads": [[8, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_conv9_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256, 64, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_conv9_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_batchnorm9_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_batchnorm9_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_batchnorm9_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_batchnorm9_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_bn_add_relu_10", 
      "attrs": {
        "max_calib_range": "20.881592", 
        "min_calib_range": "-0.000000", 
        "quantized": "true", 
        "with_bn": "true", 
        "with_postsum_relu": "true", 
        "with_sum": "true"
      }, 
      "inputs": [
        [67, 0, 0], 
        [68, 0, 0], 
        [69, 0, 0], 
        [70, 0, 0], 
        [71, 0, 0], 
        [72, 0, 1], 
        [73, 0, 1], 
        [54, 0, 0], 
        [67, 1, 0], 
        [67, 2, 0], 
        [54, 1, 0], 
        [54, 2, 0]
      ], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_bn_relu_9_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "resnetv10_stage1_conv9_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "resnetv10_stage1_conv9_bias0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "resnetv10_stage1_conv9_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(1, 1)", 
                "layout": "NCHW", 
                "no_bias": "False", 
                "num_filter": "256", 
                "num_group": "1", 
                "pad": "(0, 0)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
