{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantize_v2", 
      "name": "data_quantize", 
      "attrs": {"out_type": "auto"}, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32, 0, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_bn_relu_0", 
      "attrs": {
        "max_calib_range": "1.971370", 
        "min_calib_range": "-0.000000", 
        "quantized": "true", 
        "with_bn": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[1, 0, 0], [2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 1], [6, 0, 1], [1, 1, 0], [1, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "data0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_conv0_weight0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "ssd0_mobilenet0_conv0_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(3, 3)", 
                "layout": "NCHW", 
                "no_bias": "True", 
                "num_filter": "32", 
                "num_group": "1", 
                "pad": "(1, 1)", 
                "stride": "(2, 2)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_batchnorm0_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_batchnorm0_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_batchnorm0_running_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_batchnorm0_running_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "ssd0_mobilenet0_batchnorm0_fwd", 
              "attrs": {
                "axis": "1", 
                "eps": "1e-05", 
                "fix_gamma": "False", 
                "momentum": "0.9", 
                "use_global_stats": "False"
              }, 
              "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "ssd0_mobilenet0_relu0_fwd", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[7, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 3, 4, 5, 6], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 10, 11], 
          "heads": [[8, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_conv1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32, 0, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_batchnorm1_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_batchnorm1_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_batchnorm1_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_batchnorm1_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_bn_relu_1", 
      "attrs": {
        "max_calib_range": "4.843816", 
        "min_calib_range": "-0.000000", 
        "quantized": "true", 
        "with_bn": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[7, 0, 0], [8, 0, 0], [9, 0, 0], [10, 0, 0], [11, 0, 1], [12, 0, 1], [7, 1, 0], [7, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_bn_relu_0_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_conv1_weight0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "ssd0_mobilenet0_conv1_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(3, 3)", 
                "layout": "NCHW", 
                "no_bias": "True", 
                "num_filter": "32", 
                "num_group": "32", 
                "pad": "(1, 1)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_batchnorm1_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_batchnorm1_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_batchnorm1_running_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_batchnorm1_running_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "ssd0_mobilenet0_batchnorm1_fwd", 
              "attrs": {
                "axis": "1", 
                "eps": "1e-05", 
                "fix_gamma": "False", 
                "momentum": "0.9", 
                "use_global_stats": "False"
              }, 
              "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "ssd0_mobilenet0_relu1_fwd", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[7, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 3, 4, 5, 6], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 10, 11], 
          "heads": [[8, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_conv2_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 0, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_batchnorm2_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_batchnorm2_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_batchnorm2_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_batchnorm2_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_bn_relu_2", 
      "attrs": {
        "max_calib_range": "12.230622", 
        "min_calib_range": "-0.000000", 
        "quantized": "true", 
        "with_bn": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[13, 0, 0], [14, 0, 0], [15, 0, 0], [16, 0, 0], [17, 0, 1], [18, 0, 1], [13, 1, 0], [13, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_bn_relu_1_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_conv2_weight0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "ssd0_mobilenet0_conv2_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(1, 1)", 
                "layout": "NCHW", 
                "no_bias": "True", 
                "num_filter": "64", 
                "num_group": "1", 
                "pad": "(0, 0)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_batchnorm2_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_batchnorm2_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_batchnorm2_running_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_batchnorm2_running_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "ssd0_mobilenet0_batchnorm2_fwd", 
              "attrs": {
                "axis": "1", 
                "eps": "1e-05", 
                "fix_gamma": "False", 
                "momentum": "0.9", 
                "use_global_stats": "False"
              }, 
              "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "ssd0_mobilenet0_relu2_fwd", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[7, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 3, 4, 5, 6], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 10, 11], 
          "heads": [[8, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_conv3_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 0, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_batchnorm3_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_batchnorm3_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_batchnorm3_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_batchnorm3_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_bn_relu_3", 
      "attrs": {
        "max_calib_range": "4.503809", 
        "min_calib_range": "-0.000000", 
        "quantized": "true", 
        "with_bn": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[19, 0, 0], [20, 0, 0], [21, 0, 0], [22, 0, 0], [23, 0, 1], [24, 0, 1], [19, 1, 0], [19, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_bn_relu_2_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_conv3_weight0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "ssd0_mobilenet0_conv3_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(3, 3)", 
                "layout": "NCHW", 
                "no_bias": "True", 
                "num_filter": "64", 
                "num_group": "64", 
                "pad": "(1, 1)", 
                "stride": "(2, 2)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_batchnorm3_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_batchnorm3_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_batchnorm3_running_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_batchnorm3_running_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "ssd0_mobilenet0_batchnorm3_fwd", 
              "attrs": {
                "axis": "1", 
                "eps": "1e-05", 
                "fix_gamma": "False", 
                "momentum": "0.9", 
                "use_global_stats": "False"
              }, 
              "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "ssd0_mobilenet0_relu3_fwd", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[7, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 3, 4, 5, 6], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 10, 11], 
          "heads": [[8, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_conv4_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(128, 0, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_batchnorm4_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_batchnorm4_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_batchnorm4_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_batchnorm4_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_bn_relu_4", 
      "attrs": {
        "max_calib_range": "3.454003", 
        "min_calib_range": "-0.000000", 
        "quantized": "true", 
        "with_bn": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[25, 0, 0], [26, 0, 0], [27, 0, 0], [28, 0, 0], [29, 0, 1], [30, 0, 1], [25, 1, 0], [25, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_bn_relu_3_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_conv4_weight0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "ssd0_mobilenet0_conv4_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(1, 1)", 
                "layout": "NCHW", 
                "no_bias": "True", 
                "num_filter": "128", 
                "num_group": "1", 
                "pad": "(0, 0)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_batchnorm4_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_batchnorm4_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_batchnorm4_running_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_batchnorm4_running_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "ssd0_mobilenet0_batchnorm4_fwd", 
              "attrs": {
                "axis": "1", 
                "eps": "1e-05", 
                "fix_gamma": "False", 
                "momentum": "0.9", 
                "use_global_stats": "False"
              }, 
              "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "ssd0_mobilenet0_relu4_fwd", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[7, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 3, 4, 5, 6], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 10, 11], 
          "heads": [[8, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_conv5_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(128, 0, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_batchnorm5_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_batchnorm5_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_batchnorm5_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_batchnorm5_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_bn_relu_5", 
      "attrs": {
        "max_calib_range": "4.388649", 
        "min_calib_range": "-0.000000", 
        "quantized": "true", 
        "with_bn": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[31, 0, 0], [32, 0, 0], [33, 0, 0], [34, 0, 0], [35, 0, 1], [36, 0, 1], [31, 1, 0], [31, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_bn_relu_4_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_conv5_weight0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "ssd0_mobilenet0_conv5_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(3, 3)", 
                "layout": "NCHW", 
                "no_bias": "True", 
                "num_filter": "128", 
                "num_group": "128", 
                "pad": "(1, 1)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_batchnorm5_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_batchnorm5_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_batchnorm5_running_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_batchnorm5_running_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "ssd0_mobilenet0_batchnorm5_fwd", 
              "attrs": {
                "axis": "1", 
                "eps": "1e-05", 
                "fix_gamma": "False", 
                "momentum": "0.9", 
                "use_global_stats": "False"
              }, 
              "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "ssd0_mobilenet0_relu5_fwd", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[7, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 3, 4, 5, 6], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 10, 11], 
          "heads": [[8, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_conv6_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(128, 0, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_batchnorm6_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_batchnorm6_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_batchnorm6_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_batchnorm6_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_bn_relu_6", 
      "attrs": {
        "max_calib_range": "3.698938", 
        "min_calib_range": "-0.000000", 
        "quantized": "true", 
        "with_bn": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[37, 0, 0], [38, 0, 0], [39, 0, 0], [40, 0, 0], [41, 0, 1], [42, 0, 1], [37, 1, 0], [37, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_bn_relu_5_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_conv6_weight0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "ssd0_mobilenet0_conv6_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(1, 1)", 
                "layout": "NCHW", 
                "no_bias": "True", 
                "num_filter": "128", 
                "num_group": "1", 
                "pad": "(0, 0)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_batchnorm6_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_batchnorm6_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_batchnorm6_running_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_batchnorm6_running_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "ssd0_mobilenet0_batchnorm6_fwd", 
              "attrs": {
                "axis": "1", 
                "eps": "1e-05", 
                "fix_gamma": "False", 
                "momentum": "0.9", 
                "use_global_stats": "False"
              }, 
              "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "ssd0_mobilenet0_relu6_fwd", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[7, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 3, 4, 5, 6], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 10, 11], 
          "heads": [[8, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_conv7_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(128, 0, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_batchnorm7_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_batchnorm7_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_batchnorm7_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_batchnorm7_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_bn_relu_7", 
      "attrs": {
        "max_calib_range": "3.953003", 
        "min_calib_range": "-0.000000", 
        "quantized": "true", 
        "with_bn": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[43, 0, 0], [44, 0, 0], [45, 0, 0], [46, 0, 0], [47, 0, 1], [48, 0, 1], [43, 1, 0], [43, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_bn_relu_6_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_conv7_weight0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "ssd0_mobilenet0_conv7_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(3, 3)", 
                "layout": "NCHW", 
                "no_bias": "True", 
                "num_filter": "128", 
                "num_group": "128", 
                "pad": "(1, 1)", 
                "stride": "(2, 2)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_batchnorm7_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_batchnorm7_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_batchnorm7_running_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_batchnorm7_running_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "ssd0_mobilenet0_batchnorm7_fwd", 
              "attrs": {
                "axis": "1", 
                "eps": "1e-05", 
                "fix_gamma": "False", 
                "momentum": "0.9", 
                "use_global_stats": "False"
              }, 
              "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "ssd0_mobilenet0_relu7_fwd", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[7, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 3, 4, 5, 6], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 10, 11], 
          "heads": [[8, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_conv8_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256, 0, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_batchnorm8_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_batchnorm8_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_batchnorm8_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_batchnorm8_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_bn_relu_8", 
      "attrs": {
        "max_calib_range": "2.041146", 
        "min_calib_range": "-0.000000", 
        "quantized": "true", 
        "with_bn": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[49, 0, 0], [50, 0, 0], [51, 0, 0], [52, 0, 0], [53, 0, 1], [54, 0, 1], [49, 1, 0], [49, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_bn_relu_7_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_conv8_weight0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "ssd0_mobilenet0_conv8_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(1, 1)", 
                "layout": "NCHW", 
                "no_bias": "True", 
                "num_filter": "256", 
                "num_group": "1", 
                "pad": "(0, 0)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_batchnorm8_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_batchnorm8_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_batchnorm8_running_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_batchnorm8_running_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "ssd0_mobilenet0_batchnorm8_fwd", 
              "attrs": {
                "axis": "1", 
                "eps": "1e-05", 
                "fix_gamma": "False", 
                "momentum": "0.9", 
                "use_global_stats": "False"
              }, 
              "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "ssd0_mobilenet0_relu8_fwd", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[7, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 3, 4, 5, 6], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 10, 11], 
          "heads": [[8, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_conv9_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256, 0, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_batchnorm9_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_batchnorm9_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_batchnorm9_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_batchnorm9_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_bn_relu_9", 
      "attrs": {
        "max_calib_range": "3.181829", 
        "min_calib_range": "-0.000000", 
        "quantized": "true", 
        "with_bn": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[55, 0, 0], [56, 0, 0], [57, 0, 0], [58, 0, 0], [59, 0, 1], [60, 0, 1], [55, 1, 0], [55, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_bn_relu_8_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_conv9_weight0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "ssd0_mobilenet0_conv9_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(3, 3)", 
                "layout": "NCHW", 
                "no_bias": "True", 
                "num_filter": "256", 
                "num_group": "256", 
                "pad": "(1, 1)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_batchnorm9_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_batchnorm9_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_batchnorm9_running_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_batchnorm9_running_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "ssd0_mobilenet0_batchnorm9_fwd", 
              "attrs": {
                "axis": "1", 
                "eps": "1e-05", 
                "fix_gamma": "False", 
                "momentum": "0.9", 
                "use_global_stats": "False"
              }, 
              "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "ssd0_mobilenet0_relu9_fwd", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[7, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 3, 4, 5, 6], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 10, 11], 
          "heads": [[8, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_conv10_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256, 0, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_batchnorm10_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_batchnorm10_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_batchnorm10_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_batchnorm10_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_bn_relu_10", 
      "attrs": {
        "max_calib_range": "1.957919", 
        "min_calib_range": "-0.000000", 
        "quantized": "true", 
        "with_bn": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[61, 0, 0], [62, 0, 0], [63, 0, 0], [64, 0, 0], [65, 0, 1], [66, 0, 1], [61, 1, 0], [61, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_bn_relu_9_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_conv10_weight0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "ssd0_mobilenet0_conv10_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(1, 1)", 
                "layout": "NCHW", 
                "no_bias": "True", 
                "num_filter": "256", 
                "num_group": "1", 
                "pad": "(0, 0)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_batchnorm10_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_batchnorm10_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_batchnorm10_running_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_batchnorm10_running_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "ssd0_mobilenet0_batchnorm10_fwd", 
              "attrs": {
                "axis": "1", 
                "eps": "1e-05", 
                "fix_gamma": "False", 
                "momentum": "0.9", 
                "use_global_stats": "False"
              }, 
              "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "ssd0_mobilenet0_relu10_fwd", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[7, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 3, 4, 5, 6], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 10, 11], 
          "heads": [[8, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_conv11_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256, 0, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_batchnorm11_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_batchnorm11_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_batchnorm11_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_mobilenet0_batchnorm11_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_bn_relu_11", 
      "attrs": {
        "max_calib_range": "3.375719", 
        "min_calib_range": "-0.000000", 
        "quantized": "true", 
        "with_bn": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[67, 0, 0], [68, 0, 0], [69, 0, 0], [70, 0, 0], [71, 0, 1], [72, 0, 1], [67, 1, 0], [67, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_bn_relu_10_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_conv11_weight0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "ssd0_mobilenet0_conv11_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(3, 3)", 
                "layout": "NCHW", 
                "no_bias": "True", 
                "num_filter": "256", 
                "num_group": "256", 
                "pad": "(1, 1)", 
                "stride": "(2, 2)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_batchnorm11_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_batchnorm11_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_batchnorm11_running_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_mobilenet0_batchnorm11_running_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "ssd0_mobilenet0_batchnorm11_fwd", 
              "attrs": {
                "axis": "1", 
                "eps": "1e-05", 
                "fix_gamma": "False", 
                "momentum": "0.9", 
                "use_global_stats": "False"
              }, 
