{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_vggatrousextractor0_init_scale", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "Constant_ssd0_vggatrousextractor0_init_scale_139813762548568", 
        "__lr_mult__": "1.0", 
        "__shape__": "(1, 3, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "ssd0_vggatrousextractor0_broadcast_mul0", 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "_contrib_quantize_v2", 
      "name": "ssd0_vggatrousextractor0_broadcast_mul0_0_quantize", 
      "attrs": {"out_type": "auto"}, 
      "inputs": [[2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ssd0_vggatrousextractor0_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 3, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_vggatrousextractor0_conv0_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_relu_0", 
      "attrs": {
        "max_calib_range": "799.719299", 
        "min_calib_range": "-0.000000", 
        "quantized": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [3, 1, 0], [3, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "ssd0_vggatrousextractor0_broadcast_mul0_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_vggatrousextractor0_conv0_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_vggatrousextractor0_conv0_bias0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "ssd0_vggatrousextractor0_conv0_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(3, 3)", 
                "layout": "NCHW", 
                "no_bias": "False", 
                "num_filter": "64", 
                "num_group": "1", 
                "pad": "(1, 1)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "ssd0_vggatrousextractor0_relu0_fwd", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[3, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5], 
          "heads": [[4, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "ssd0_vggatrousextractor0_conv1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 64, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_vggatrousextractor0_conv1_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_relu_1", 
      "attrs": {
        "max_calib_range": "2801.616699", 
        "min_calib_range": "-0.000000", 
        "quantized": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[6, 0, 0], [7, 0, 0], [8, 0, 0], [6, 1, 0], [6, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_relu_0_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_vggatrousextractor0_conv1_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_vggatrousextractor0_conv1_bias0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "ssd0_vggatrousextractor0_conv1_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(3, 3)", 
                "layout": "NCHW", 
                "no_bias": "False", 
                "num_filter": "64", 
                "num_group": "1", 
                "pad": "(1, 1)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "ssd0_vggatrousextractor0_relu1_fwd", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[3, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5], 
          "heads": [[4, 0, 0]]
        }
      ]
    }, 
    {
      "op": "_contrib_quantized_pooling", 
      "name": "quantized_ssd0_vggatrousextractor0_pooling0", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[9, 0, 0], [9, 1, 0], [9, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "ssd0_vggatrousextractor0_conv2_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(128, 64, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_vggatrousextractor0_conv2_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(128,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_relu_2", 
      "attrs": {
        "max_calib_range": "5245.505859", 
        "min_calib_range": "-0.000000", 
        "quantized": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[10, 0, 0], [11, 0, 0], [12, 0, 0], [10, 1, 0], [10, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "ssd0_vggatrousextractor0_pooling0_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_vggatrousextractor0_conv2_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_vggatrousextractor0_conv2_bias0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "ssd0_vggatrousextractor0_conv2_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(3, 3)", 
                "layout": "NCHW", 
                "no_bias": "False", 
                "num_filter": "128", 
                "num_group": "1", 
                "pad": "(1, 1)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "ssd0_vggatrousextractor0_relu2_fwd", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[3, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5], 
          "heads": [[4, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "ssd0_vggatrousextractor0_conv3_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(128, 128, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_vggatrousextractor0_conv3_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(128,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_relu_3", 
      "attrs": {
        "max_calib_range": "6962.976562", 
        "min_calib_range": "-0.000000", 
        "quantized": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[13, 0, 0], [14, 0, 0], [15, 0, 0], [13, 1, 0], [13, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_relu_2_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_vggatrousextractor0_conv3_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_vggatrousextractor0_conv3_bias0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "ssd0_vggatrousextractor0_conv3_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(3, 3)", 
                "layout": "NCHW", 
                "no_bias": "False", 
                "num_filter": "128", 
                "num_group": "1", 
                "pad": "(1, 1)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "ssd0_vggatrousextractor0_relu3_fwd", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[3, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5], 
          "heads": [[4, 0, 0]]
        }
      ]
    }, 
    {
      "op": "_contrib_quantized_pooling", 
      "name": "quantized_ssd0_vggatrousextractor0_pooling1", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[16, 0, 0], [16, 1, 0], [16, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "ssd0_vggatrousextractor0_conv4_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256, 128, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_vggatrousextractor0_conv4_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_relu_4", 
      "attrs": {
        "max_calib_range": "6951.934082", 
        "min_calib_range": "-0.000000", 
        "quantized": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[17, 0, 0], [18, 0, 0], [19, 0, 0], [17, 1, 0], [17, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "ssd0_vggatrousextractor0_pooling1_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_vggatrousextractor0_conv4_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_vggatrousextractor0_conv4_bias0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "ssd0_vggatrousextractor0_conv4_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(3, 3)", 
                "layout": "NCHW", 
                "no_bias": "False", 
                "num_filter": "256", 
                "num_group": "1", 
                "pad": "(1, 1)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "ssd0_vggatrousextractor0_relu4_fwd", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[3, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5], 
          "heads": [[4, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "ssd0_vggatrousextractor0_conv5_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256, 256, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_vggatrousextractor0_conv5_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_relu_5", 
      "attrs": {
        "max_calib_range": "5921.893066", 
        "min_calib_range": "-0.000000", 
        "quantized": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[20, 0, 0], [21, 0, 0], [22, 0, 0], [20, 1, 0], [20, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_relu_4_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_vggatrousextractor0_conv5_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_vggatrousextractor0_conv5_bias0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "ssd0_vggatrousextractor0_conv5_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(3, 3)", 
                "layout": "NCHW", 
                "no_bias": "False", 
                "num_filter": "256", 
                "num_group": "1", 
                "pad": "(1, 1)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "ssd0_vggatrousextractor0_relu5_fwd", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[3, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5], 
          "heads": [[4, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "ssd0_vggatrousextractor0_conv6_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256, 256, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_vggatrousextractor0_conv6_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_relu_6", 
      "attrs": {
        "max_calib_range": "5161.966797", 
        "min_calib_range": "-0.000000", 
        "quantized": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[23, 0, 0], [24, 0, 0], [25, 0, 0], [23, 1, 0], [23, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_relu_5_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_vggatrousextractor0_conv6_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_vggatrousextractor0_conv6_bias0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "ssd0_vggatrousextractor0_conv6_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(3, 3)", 
                "layout": "NCHW", 
                "no_bias": "False", 
                "num_filter": "256", 
                "num_group": "1", 
                "pad": "(1, 1)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "ssd0_vggatrousextractor0_relu6_fwd", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[3, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5], 
          "heads": [[4, 0, 0]]
        }
      ]
    }, 
    {
      "op": "_contrib_quantized_pooling", 
      "name": "quantized_ssd0_vggatrousextractor0_pooling2", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[26, 0, 0], [26, 1, 0], [26, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "ssd0_vggatrousextractor0_conv7_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(512, 256, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_vggatrousextractor0_conv7_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(512,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_relu_7", 
      "attrs": {
        "max_calib_range": "4225.403320", 
        "min_calib_range": "-0.000000", 
        "quantized": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[27, 0, 0], [28, 0, 0], [29, 0, 0], [27, 1, 0], [27, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "ssd0_vggatrousextractor0_pooling2_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_vggatrousextractor0_conv7_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_vggatrousextractor0_conv7_bias0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "ssd0_vggatrousextractor0_conv7_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(3, 3)", 
                "layout": "NCHW", 
                "no_bias": "False", 
                "num_filter": "512", 
                "num_group": "1", 
                "pad": "(1, 1)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "ssd0_vggatrousextractor0_relu7_fwd", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[3, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5], 
          "heads": [[4, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "ssd0_vggatrousextractor0_conv8_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(512, 512, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_vggatrousextractor0_conv8_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(512,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_relu_8", 
      "attrs": {
        "max_calib_range": "1302.792358", 
        "min_calib_range": "-0.000000", 
        "quantized": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[30, 0, 0], [31, 0, 0], [32, 0, 0], [30, 1, 0], [30, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_relu_7_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_vggatrousextractor0_conv8_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_vggatrousextractor0_conv8_bias0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "ssd0_vggatrousextractor0_conv8_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(3, 3)", 
                "layout": "NCHW", 
                "no_bias": "False", 
                "num_filter": "512", 
                "num_group": "1", 
                "pad": "(1, 1)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "ssd0_vggatrousextractor0_relu8_fwd", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[3, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5], 
          "heads": [[4, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "ssd0_vggatrousextractor0_conv9_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(512, 512, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_vggatrousextractor0_conv9_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(512,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_relu_9", 
      "attrs": {
        "max_calib_range": "658.651978", 
        "min_calib_range": "-0.000000", 
        "quantized": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[33, 0, 0], [34, 0, 0], [35, 0, 0], [33, 1, 0], [33, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_relu_8_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_vggatrousextractor0_conv9_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_vggatrousextractor0_conv9_bias0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "ssd0_vggatrousextractor0_conv9_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(3, 3)", 
                "layout": "NCHW", 
                "no_bias": "False", 
                "num_filter": "512", 
                "num_group": "1", 
                "pad": "(1, 1)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "ssd0_vggatrousextractor0_relu9_fwd", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[3, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5], 
          "heads": [[4, 0, 0]]
        }
      ]
    }, 
    {
      "op": "_contrib_dequantize", 
      "name": "sg_mkldnn_conv_relu_9_dequantize", 
      "inputs": [[36, 0, 0], [36, 1, 0], [36, 2, 0]]
    }, 
    {
      "op": "L2Normalization", 
      "name": "ssd0_vggatrousextractor0_normalize0_l2normalization0", 
      "attrs": {
        "eps": "1e-05", 
        "mode": "channel"
      }, 
      "inputs": [[37, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ssd0_vggatrousextractor0_normalize0_normalize_scale", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"constant\", {\"value\": 20}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(1, 512, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "ssd0_vggatrousextractor0_normalize0_broadcast_mul0", 
      "inputs": [[38, 0, 0], [39, 0, 0]]
    }, 
    {
      "op": "_contrib_quantize_v2", 
      "name": "ssd0_vggatrousextractor0_normalize0_broadcast_mul0_0_quantize", 
      "attrs": {"out_type": "auto"}, 
      "inputs": [[40, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ssd0_convpredictor0_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"uniform\", \"factor_type\": \"avg\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(84, 512, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_convpredictor0_conv0_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(84,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_10", 
      "attrs": {
        "max_calib_range": "15.419542", 
        "min_calib_range": "-6.482797", 
        "quantized": "true"
      }, 
      "inputs": [[41, 0, 0], [42, 0, 0], [43, 0, 0], [41, 1, 0], [41, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "ssd0_vggatrousextractor0_normalize0_broadcast_mul0_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_convpredictor0_conv0_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_convpredictor0_conv0_bias0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "ssd0_convpredictor0_conv0_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(3, 3)", 
                "layout": "NCHW", 
                "no_bias": "False", 
                "num_filter": "84", 
                "num_group": "1", 
                "pad": "(1, 1)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2], 
          "node_row_ptr": [0, 1, 2, 3, 4], 
          "heads": [[3, 0, 0]]
        }
      ]
    }, 
    {
      "op": "_contrib_dequantize", 
      "name": "sg_mkldnn_conv_10_dequantize", 
      "inputs": [[44, 0, 0], [44, 1, 0], [44, 2, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "ssd0_transpose0", 
      "attrs": {"axes": "(0, 2, 3, 1)"}, 
      "inputs": [[45, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "ssd0_flatten0", 
      "inputs": [[46, 0, 0]]
    }, 
    {
      "op": "_contrib_quantized_pooling", 
      "name": "quantized_ssd0_vggatrousextractor0_pooling3", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[36, 0, 0], [36, 1, 0], [36, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "ssd0_vggatrousextractor0_conv10_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(512, 512, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_vggatrousextractor0_conv10_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(512,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_relu_11", 
      "attrs": {
        "max_calib_range": "422.220123", 
        "min_calib_range": "-0.000000", 
        "quantized": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[48, 0, 0], [49, 0, 0], [50, 0, 0], [48, 1, 0], [48, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "ssd0_vggatrousextractor0_pooling3_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_vggatrousextractor0_conv10_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_vggatrousextractor0_conv10_bias0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "ssd0_vggatrousextractor0_conv10_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(3, 3)", 
                "layout": "NCHW", 
                "no_bias": "False", 
                "num_filter": "512", 
                "num_group": "1", 
                "pad": "(1, 1)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "ssd0_vggatrousextractor0_relu10_fwd", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[3, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5], 
          "heads": [[4, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "ssd0_vggatrousextractor0_conv11_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(512, 512, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_vggatrousextractor0_conv11_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(512,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_relu_12", 
      "attrs": {
        "max_calib_range": "186.000427", 
        "min_calib_range": "-0.000000", 
        "quantized": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[51, 0, 0], [52, 0, 0], [53, 0, 0], [51, 1, 0], [51, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_relu_11_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_vggatrousextractor0_conv11_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_vggatrousextractor0_conv11_bias0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "ssd0_vggatrousextractor0_conv11_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(3, 3)", 
                "layout": "NCHW", 
                "no_bias": "False", 
                "num_filter": "512", 
                "num_group": "1", 
                "pad": "(1, 1)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "ssd0_vggatrousextractor0_relu11_fwd", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[3, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5], 
          "heads": [[4, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "ssd0_vggatrousextractor0_conv12_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(512, 512, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_vggatrousextractor0_conv12_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(512,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_relu_13", 
      "attrs": {
        "max_calib_range": "129.571381", 
        "min_calib_range": "-0.000000", 
        "quantized": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[54, 0, 0], [55, 0, 0], [56, 0, 0], [54, 1, 0], [54, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_relu_12_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_vggatrousextractor0_conv12_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_vggatrousextractor0_conv12_bias0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "ssd0_vggatrousextractor0_conv12_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(3, 3)", 
                "layout": "NCHW", 
                "no_bias": "False", 
                "num_filter": "512", 
                "num_group": "1", 
                "pad": "(1, 1)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "ssd0_vggatrousextractor0_relu12_fwd", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[3, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5], 
          "heads": [[4, 0, 0]]
        }
      ]
    }, 
    {
      "op": "_contrib_quantized_pooling", 
      "name": "quantized_ssd0_vggatrousextractor0_pooling4", 
      "attrs": {
        "kernel": "(3, 3)", 
        "pad": "(1, 1)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[57, 0, 0], [57, 1, 0], [57, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "ssd0_vggatrousextractor0_dilated_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(1024, 512, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_vggatrousextractor0_dilated_conv0_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(1024,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_relu_14", 
      "attrs": {
        "max_calib_range": "31.570829", 
        "min_calib_range": "-0.000000", 
        "quantized": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[58, 0, 0], [59, 0, 0], [60, 0, 0], [58, 1, 0], [58, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "ssd0_vggatrousextractor0_pooling4_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_vggatrousextractor0_dilated_conv0_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_vggatrousextractor0_dilated_conv0_bias0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "ssd0_vggatrousextractor0_dilated_conv0_fwd", 
              "attrs": {
                "dilate": "(6, 6)", 
                "kernel": "(3, 3)", 
                "layout": "NCHW", 
                "no_bias": "False", 
                "num_filter": "1024", 
                "num_group": "1", 
                "pad": "(6, 6)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "ssd0_vggatrousextractor0_dilated_relu0_fwd", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[3, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5], 
          "heads": [[4, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "ssd0_vggatrousextractor0_dilated_conv1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(1024, 1024, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_vggatrousextractor0_dilated_conv1_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(1024,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_relu_15", 
      "attrs": {
        "max_calib_range": "10.395283", 
        "min_calib_range": "-0.000000", 
        "quantized": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[61, 0, 0], [62, 0, 0], [63, 0, 0], [61, 1, 0], [61, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_relu_14_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_vggatrousextractor0_dilated_conv1_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_vggatrousextractor0_dilated_conv1_bias0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "ssd0_vggatrousextractor0_dilated_conv1_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(1, 1)", 
                "layout": "NCHW", 
                "no_bias": "False", 
                "num_filter": "1024", 
                "num_group": "1", 
                "pad": "(0, 0)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "ssd0_vggatrousextractor0_dilated_relu1_fwd", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[3, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5], 
          "heads": [[4, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "ssd0_convpredictor2_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"uniform\", \"factor_type\": \"avg\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(126, 1024, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_convpredictor2_conv0_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(126,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_16", 
      "attrs": {
        "max_calib_range": "31.327047", 
        "min_calib_range": "-8.904353", 
        "quantized": "true"
      }, 
      "inputs": [[64, 0, 0], [65, 0, 0], [66, 0, 0], [64, 1, 0], [64, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_relu_15_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_convpredictor2_conv0_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_convpredictor2_conv0_bias0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "ssd0_convpredictor2_conv0_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(3, 3)", 
                "layout": "NCHW", 
                "no_bias": "False", 
                "num_filter": "126", 
                "num_group": "1", 
                "pad": "(1, 1)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2], 
          "node_row_ptr": [0, 1, 2, 3, 4], 
          "heads": [[3, 0, 0]]
        }
      ]
    }, 
    {
      "op": "_contrib_dequantize", 
      "name": "sg_mkldnn_conv_16_dequantize", 
      "inputs": [[67, 0, 0], [67, 1, 0], [67, 2, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "ssd0_transpose1", 
      "attrs": {"axes": "(0, 2, 3, 1)"}, 
      "inputs": [[68, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "ssd0_flatten1", 
      "inputs": [[69, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ssd0_vggatrousextractor0_extra0_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256, 1024, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_vggatrousextractor0_extra0_conv0_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_relu_17", 
      "attrs": {
        "max_calib_range": "8.586086", 
        "min_calib_range": "-0.000000", 
        "quantized": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[64, 0, 0], [71, 0, 0], [72, 0, 0], [64, 1, 0], [64, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_relu_15_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_vggatrousextractor0_extra0_conv0_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_vggatrousextractor0_extra0_conv0_bias0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "ssd0_vggatrousextractor0_extra0_conv0_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(1, 1)", 
                "layout": "NCHW", 
                "no_bias": "False", 
                "num_filter": "256", 
                "num_group": "1", 
                "pad": "(0, 0)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "ssd0_vggatrousextractor0_extra0_relu0_fwd", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[3, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5], 
          "heads": [[4, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "ssd0_vggatrousextractor0_extra0_conv1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(512, 256, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ssd0_vggatrousextractor0_extra0_conv1_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(512,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_relu_18", 
      "attrs": {
        "max_calib_range": "10.733885", 
        "min_calib_range": "-0.000000", 
        "quantized": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[73, 0, 0], [74, 0, 0], [75, 0, 0], [73, 1, 0], [73, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_relu_17_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_vggatrousextractor0_extra0_conv1_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "ssd0_vggatrousextractor0_extra0_conv1_bias0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "ssd0_vggatrousextractor0_extra0_conv1_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(3, 3)", 
                "layout": "NCHW", 
                "no_bias": "False", 
                "num_filter": "512", 
                "num_group": "1", 
                "pad": "(1, 1)", 
                "stride": "(2, 2)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "Activation", 
