{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantize_v2", 
      "name": "data_quantize", 
      "attrs": {
        "max_calib_range": "2.640000", 
        "min_calib_range": "-2.117904", 
        "out_type": "auto"
      }, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 3, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_bn_act_0", 
      "attrs": {
        "max_calib_range": "3.943690", 
        "min_calib_range": "0.000000", 
        "quantized": "true", 
        "with_act": "true", 
        "with_bn": "true"
      }, 
      "inputs": [[1, 0, 0], [2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 1], [6, 0, 1], [1, 1, 0], [1, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "data0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_conv0_weight0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "fcn0_resnetv1s_conv0_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(3, 3)", 
                "layout": "NCHW", 
                "no_bias": "True", 
                "num_filter": "64", 
                "num_group": "1", 
                "pad": "(1, 1)", 
                "stride": "(2, 2)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_batchnorm0_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_batchnorm0_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_batchnorm0_running_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_batchnorm0_running_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "fcn0_resnetv1s_batchnorm0_fwd", 
              "attrs": {
                "axis": "1", 
                "eps": "1e-05", 
                "fix_gamma": "False", 
                "momentum": "0.9", 
                "use_global_stats": "False"
              }, 
              "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "fcn0_resnetv1s_relu0_fwd", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[7, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 3, 4, 5, 6], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 10, 11], 
          "heads": [[8, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_conv1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 64, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_batchnorm1_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_batchnorm1_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_batchnorm1_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_batchnorm1_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_bn_act_1", 
      "attrs": {
        "max_calib_range": "4.210079", 
        "min_calib_range": "0.000000", 
        "quantized": "true", 
        "with_act": "true", 
        "with_bn": "true"
      }, 
      "inputs": [[7, 0, 0], [8, 0, 0], [9, 0, 0], [10, 0, 0], [11, 0, 1], [12, 0, 1], [7, 1, 0], [7, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_bn_act_0_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_conv1_weight0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "fcn0_resnetv1s_conv1_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(3, 3)", 
                "layout": "NCHW", 
                "no_bias": "True", 
                "num_filter": "64", 
                "num_group": "1", 
                "pad": "(1, 1)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_batchnorm1_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_batchnorm1_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_batchnorm1_running_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_batchnorm1_running_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "fcn0_resnetv1s_batchnorm1_fwd", 
              "attrs": {
                "axis": "1", 
                "eps": "1e-05", 
                "fix_gamma": "False", 
                "momentum": "0.9", 
                "use_global_stats": "False"
              }, 
              "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "fcn0_resnetv1s_relu1_fwd", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[7, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 3, 4, 5, 6], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 10, 11], 
          "heads": [[8, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_conv2_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(128, 64, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_batchnorm2_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(128,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_batchnorm2_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(128,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_batchnorm2_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(128,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_batchnorm2_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(128,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_bn_act_2", 
      "attrs": {
        "max_calib_range": "2.345301", 
        "min_calib_range": "0.000000", 
        "quantized": "true", 
        "with_act": "true", 
        "with_bn": "true"
      }, 
      "inputs": [[13, 0, 0], [14, 0, 0], [15, 0, 0], [16, 0, 0], [17, 0, 1], [18, 0, 1], [13, 1, 0], [13, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_bn_act_1_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_conv2_weight0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "fcn0_resnetv1s_conv2_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(3, 3)", 
                "layout": "NCHW", 
                "no_bias": "True", 
                "num_filter": "128", 
                "num_group": "1", 
                "pad": "(1, 1)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_batchnorm2_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_batchnorm2_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_batchnorm2_running_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_batchnorm2_running_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "fcn0_resnetv1s_batchnorm2_fwd", 
              "attrs": {
                "axis": "1", 
                "eps": "1e-05", 
                "fix_gamma": "False", 
                "momentum": "0.9", 
                "use_global_stats": "False"
              }, 
              "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "fcn0_resnetv1s_relu2_fwd", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[7, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 3, 4, 5, 6], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 10, 11], 
          "heads": [[8, 0, 0]]
        }
      ]
    }, 
    {
      "op": "_contrib_quantized_pooling", 
      "name": "quantized_fcn0_resnetv1s_pool0_fwd", 
      "attrs": {
        "global_pool": "False", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "pad": "(1, 1)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[19, 0, 0], [19, 1, 0], [19, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_layers1_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 128, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_layers1_batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_layers1_batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_layers1_batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_layers1_batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_bn_act_3", 
      "attrs": {
        "max_calib_range": "1.280785", 
        "min_calib_range": "0.000000", 
        "quantized": "true", 
        "with_act": "true", 
        "with_bn": "true"
      }, 
      "inputs": [[20, 0, 0], [21, 0, 0], [22, 0, 0], [23, 0, 0], [24, 0, 1], [25, 0, 1], [20, 1, 0], [20, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_pool0_fwd_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_layers1_conv0_weight0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "fcn0_resnetv1s_layers1_conv0_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(1, 1)", 
                "layout": "NCHW", 
                "no_bias": "True", 
                "num_filter": "64", 
                "num_group": "1", 
                "pad": "(0, 0)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_layers1_batchnorm0_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_layers1_batchnorm0_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_layers1_batchnorm0_running_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_layers1_batchnorm0_running_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "fcn0_resnetv1s_layers1_batchnorm0_fwd", 
              "attrs": {
                "axis": "1", 
                "eps": "1e-05", 
                "fix_gamma": "False", 
                "momentum": "0.9", 
                "use_global_stats": "False"
              }, 
              "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "fcn0_resnetv1s_layers1_relu0_fwd", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[7, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 3, 4, 5, 6], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 10, 11], 
          "heads": [[8, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_layers1_conv1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 64, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_layers1_batchnorm1_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_layers1_batchnorm1_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_layers1_batchnorm1_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_layers1_batchnorm1_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_bn_act_4", 
      "attrs": {
        "max_calib_range": "1.287391", 
        "min_calib_range": "0.000000", 
        "quantized": "true", 
        "with_act": "true", 
        "with_bn": "true"
      }, 
      "inputs": [[26, 0, 0], [27, 0, 0], [28, 0, 0], [29, 0, 0], [30, 0, 1], [31, 0, 1], [26, 1, 0], [26, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_bn_act_3_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_layers1_conv1_weight0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "fcn0_resnetv1s_layers1_conv1_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(3, 3)", 
                "layout": "NCHW", 
                "no_bias": "True", 
                "num_filter": "64", 
                "num_group": "1", 
                "pad": "(1, 1)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_layers1_batchnorm1_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_layers1_batchnorm1_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_layers1_batchnorm1_running_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_layers1_batchnorm1_running_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "fcn0_resnetv1s_layers1_batchnorm1_fwd", 
              "attrs": {
                "axis": "1", 
                "eps": "1e-05", 
                "fix_gamma": "False", 
                "momentum": "0.9", 
                "use_global_stats": "False"
              }, 
              "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "fcn0_resnetv1s_layers1_relu1_fwd", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[7, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 3, 4, 5, 6], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 10, 11], 
          "heads": [[8, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_layers1_conv2_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256, 64, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_layers1_batchnorm2_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_layers1_batchnorm2_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_layers1_batchnorm2_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_layers1_batchnorm2_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_down1_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256, 128, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_down1_batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_down1_batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_down1_batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_down1_batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_bn_6", 
      "attrs": {
        "max_calib_range": "2.631946", 
        "min_calib_range": "-2.539690", 
        "quantized": "true", 
        "with_bn": "true"
      }, 
      "inputs": [[20, 0, 0], [38, 0, 0], [39, 0, 0], [40, 0, 0], [41, 0, 1], [42, 0, 1], [20, 1, 0], [20, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_pool0_fwd_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_down1_conv0_weight0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "fcn0_resnetv1s_down1_conv0_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(1, 1)", 
                "layout": "NCHW", 
                "no_bias": "True", 
                "num_filter": "256", 
                "num_group": "1", 
                "pad": "(0, 0)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_down1_batchnorm0_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_down1_batchnorm0_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_down1_batchnorm0_running_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_down1_batchnorm0_running_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "fcn0_resnetv1s_down1_batchnorm0_fwd", 
              "attrs": {
                "axis": "1", 
                "eps": "1e-05", 
                "fix_gamma": "False", 
                "momentum": "0.9", 
                "use_global_stats": "False"
              }, 
              "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 3, 4, 5, 6], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 10], 
          "heads": [[7, 0, 0]]
        }
      ]
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_bn_add_act_5", 
      "attrs": {
        "max_calib_range": "2.736636", 
        "min_calib_range": "0.000000", 
        "quantized": "true", 
        "with_bn": "true", 
        "with_postsum_act": "true", 
        "with_sum": "true"
      }, 
      "inputs": [
        [32, 0, 0], 
        [33, 0, 0], 
        [34, 0, 0], 
        [35, 0, 0], 
        [36, 0, 1], 
        [37, 0, 1], 
        [43, 0, 0], 
        [32, 1, 0], 
        [32, 2, 0], 
        [43, 1, 0], 
        [43, 2, 0]
      ], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_bn_act_4_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_layers1_conv2_weight0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "fcn0_resnetv1s_layers1_conv2_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(1, 1)", 
                "layout": "NCHW", 
                "no_bias": "True", 
                "num_filter": "256", 
                "num_group": "1", 
                "pad": "(0, 0)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_layers1_batchnorm2_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_layers1_batchnorm2_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_layers1_batchnorm2_running_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_layers1_batchnorm2_running_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "fcn0_resnetv1s_layers1_batchnorm2_fwd", 
              "attrs": {
                "axis": "1", 
                "eps": "1e-05", 
                "fix_gamma": "False", 
                "momentum": "0.9", 
                "use_global_stats": "False"
              }, 
              "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_down1_batchnorm0_fwd_output0", 
              "inputs": []
            }, 
            {
              "op": "elemwise_add", 
              "name": "fcn0_resnetv1s_layers1_bottleneckv1b0__plus0", 
              "inputs": [[7, 0, 0], [8, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "fcn0_resnetv1s_layers1_relu2_fwd", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[9, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 3, 4, 5, 6, 8], 
          "node_row_ptr": [
            0, 
            1, 
            2, 
            3, 
            4, 
            5, 
            6, 
            7, 
            10, 
            11, 
            12, 
            13
          ], 
          "heads": [[10, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_layers1_conv3_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 256, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_layers1_batchnorm3_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_layers1_batchnorm3_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_layers1_batchnorm3_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_layers1_batchnorm3_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_bn_act_7", 
      "attrs": {
        "max_calib_range": "1.533846", 
        "min_calib_range": "0.000000", 
        "quantized": "true", 
        "with_act": "true", 
        "with_bn": "true"
      }, 
      "inputs": [[44, 0, 0], [45, 0, 0], [46, 0, 0], [47, 0, 0], [48, 0, 1], [49, 0, 1], [44, 1, 0], [44, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_bn_add_act_5_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_layers1_conv3_weight0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "fcn0_resnetv1s_layers1_conv3_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(1, 1)", 
                "layout": "NCHW", 
                "no_bias": "True", 
                "num_filter": "64", 
                "num_group": "1", 
                "pad": "(0, 0)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_layers1_batchnorm3_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_layers1_batchnorm3_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_layers1_batchnorm3_running_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_layers1_batchnorm3_running_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "fcn0_resnetv1s_layers1_batchnorm3_fwd", 
              "attrs": {
                "axis": "1", 
                "eps": "1e-05", 
                "fix_gamma": "False", 
                "momentum": "0.9", 
                "use_global_stats": "False"
              }, 
              "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "fcn0_resnetv1s_layers1_relu3_fwd", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[7, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 3, 4, 5, 6], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 10, 11], 
          "heads": [[8, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_layers1_conv4_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 64, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_layers1_batchnorm4_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_layers1_batchnorm4_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_layers1_batchnorm4_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_layers1_batchnorm4_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_bn_act_8", 
      "attrs": {
        "max_calib_range": "1.316731", 
        "min_calib_range": "0.000000", 
        "quantized": "true", 
        "with_act": "true", 
        "with_bn": "true"
      }, 
      "inputs": [[50, 0, 0], [51, 0, 0], [52, 0, 0], [53, 0, 0], [54, 0, 1], [55, 0, 1], [50, 1, 0], [50, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_bn_act_7_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_layers1_conv4_weight0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "fcn0_resnetv1s_layers1_conv4_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(3, 3)", 
                "layout": "NCHW", 
                "no_bias": "True", 
                "num_filter": "64", 
                "num_group": "1", 
                "pad": "(1, 1)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_layers1_batchnorm4_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_layers1_batchnorm4_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_layers1_batchnorm4_running_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_layers1_batchnorm4_running_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "fcn0_resnetv1s_layers1_batchnorm4_fwd", 
              "attrs": {
                "axis": "1", 
                "eps": "1e-05", 
                "fix_gamma": "False", 
                "momentum": "0.9", 
                "use_global_stats": "False"
              }, 
              "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "fcn0_resnetv1s_layers1_relu4_fwd", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[7, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 3, 4, 5, 6], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 10, 11], 
          "heads": [[8, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_layers1_conv5_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256, 64, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_layers1_batchnorm5_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_layers1_batchnorm5_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_layers1_batchnorm5_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_layers1_batchnorm5_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_bn_add_act_9", 
      "attrs": {
        "max_calib_range": "2.731220", 
        "min_calib_range": "0.000000", 
        "quantized": "true", 
        "with_bn": "true", 
        "with_postsum_act": "true", 
        "with_sum": "true"
      }, 
      "inputs": [
        [56, 0, 0], 
        [57, 0, 0], 
        [58, 0, 0], 
        [59, 0, 0], 
        [60, 0, 1], 
        [61, 0, 1], 
        [44, 0, 0], 
        [56, 1, 0], 
        [56, 2, 0], 
        [44, 1, 0], 
        [44, 2, 0]
      ], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_bn_act_8_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_layers1_conv5_weight0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "fcn0_resnetv1s_layers1_conv5_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(1, 1)", 
                "layout": "NCHW", 
                "no_bias": "True", 
                "num_filter": "256", 
                "num_group": "1", 
                "pad": "(0, 0)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_layers1_batchnorm5_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_layers1_batchnorm5_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_layers1_batchnorm5_running_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_layers1_batchnorm5_running_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "fcn0_resnetv1s_layers1_batchnorm5_fwd", 
              "attrs": {
                "axis": "1", 
                "eps": "1e-05", 
                "fix_gamma": "False", 
                "momentum": "0.9", 
                "use_global_stats": "False"
              }, 
              "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_bn_add_act_5_output0", 
              "inputs": []
            }, 
            {
              "op": "elemwise_add", 
              "name": "fcn0_resnetv1s_layers1_bottleneckv1b1__plus0", 
              "inputs": [[7, 0, 0], [8, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "fcn0_resnetv1s_layers1_relu5_fwd", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[9, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 3, 4, 5, 6, 8], 
          "node_row_ptr": [
            0, 
            1, 
            2, 
            3, 
            4, 
            5, 
            6, 
            7, 
            10, 
            11, 
            12, 
            13
          ], 
          "heads": [[10, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_layers1_conv6_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 256, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_layers1_batchnorm6_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_layers1_batchnorm6_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_layers1_batchnorm6_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_layers1_batchnorm6_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_bn_act_10", 
      "attrs": {
        "max_calib_range": "1.282105", 
        "min_calib_range": "0.000000", 
        "quantized": "true", 
        "with_act": "true", 
        "with_bn": "true"
      }, 
      "inputs": [[62, 0, 0], [63, 0, 0], [64, 0, 0], [65, 0, 0], [66, 0, 1], [67, 0, 1], [62, 1, 0], [62, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_bn_add_act_9_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_layers1_conv6_weight0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "fcn0_resnetv1s_layers1_conv6_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(1, 1)", 
                "layout": "NCHW", 
                "no_bias": "True", 
                "num_filter": "64", 
                "num_group": "1", 
                "pad": "(0, 0)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_layers1_batchnorm6_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_layers1_batchnorm6_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_layers1_batchnorm6_running_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fcn0_resnetv1s_layers1_batchnorm6_running_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "fcn0_resnetv1s_layers1_batchnorm6_fwd", 
              "attrs": {
                "axis": "1", 
                "eps": "1e-05", 
                "fix_gamma": "False", 
                "momentum": "0.9", 
                "use_global_stats": "False"
              }, 
              "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "fcn0_resnetv1s_layers1_relu6_fwd", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[7, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 3, 4, 5, 6], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 10, 11], 
          "heads": [[8, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_layers1_conv7_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 64, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_layers1_batchnorm7_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_layers1_batchnorm7_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_layers1_batchnorm7_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fcn0_resnetv1s_layers1_batchnorm7_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
